In [41]:
import pandas as pd
from pathlib import Path

In [42]:
graduation_data = Path("resources/graduation_data.csv")
state_data = Path("resources/state_data.csv")

In [43]:
graduation_data_df = pd.read_csv(graduation_data)
state_data_df = pd.read_csv(state_data)
graduation_data_df.head()

                          State   2012-13
0    Alabama ..................   44233.0
1    Alaska ...................    7860.0
2    Arizona ..................   62208.0
3    Arkansas .................   28928.0
4    California ...............  422125.0

In [44]:
graduation_data_copy = graduation_data_df.copy()

In [45]:
graduation_data_copy["State"] = graduation_data_copy['State'].str.replace(r'\.+$', '', regex=True)
graduation_data_copy.head()

           State   2012-13
0       Alabama    44233.0
1        Alaska     7860.0
2       Arizona    62208.0
3      Arkansas    28928.0
4    California   422125.0

In [46]:
graduation_data_copy = graduation_data_copy.rename(columns = {"State":"State", "2012-13":"Graduates"})
graduation_data_copy.head()

           State  Graduates
0       Alabama     44233.0
1        Alaska      7860.0
2       Arizona     62208.0
3      Arkansas     28928.0
4    California    422125.0

In [48]:
graduation_data_copy.dtypes

State         object
Graduates    float64
dtype: object